Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjectType
The possible pick object types.

Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjectType.AnalysisObject
Any analysis object.

Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjectType.AnalysisPart
Analysis part object.

Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjectType.AnalysisNode
Analysis node object.

Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjectType.AnalysisNodeLink
Analysis node link object.